#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/automationproject/gh-actions-demo/runs/run-dYFFZG63MRnyBECq

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=credible-pheasant]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-050a5d134bfc3f564]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-06193d4da1352b9a4]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0ac3f21f53d7e4e96]
data.aws_ami.ubuntu: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0589a83ffe7f94f49]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-07dc2dd8e0efbc46a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00d1b188033716b49]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-078c40614c5837509]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0aa096d950e49d732]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b64a7f3b5d909d75]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a058b42f89fd11f9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08180dddf1c5d3497]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-09cf3fb9e5b6d2e65]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04a32d3228a8d4683]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a0a03df345dc2474]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0bedea0505f454bd8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-010bfb6b8aa5e93a2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d790f804e42daf0c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-05e8178be0f519008]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02d6359328b545338]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c07e9f56be88eefe]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04d2ce27d31eccc78]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ecd5bb1ca07e03f5]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b2dded4644b44556]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d5a3b174eaea604a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00d1b188033716b491080289494]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-02c1e4e481193e4cc]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0131a6d0a20386ebd]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0bedea0505f454bd81080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-010bfb6b8aa5e93a21080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a0a03df345dc24741080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0e376749ef4c911f0"
        id                   = "eipalloc-0589a83ffe7f94f49"
      + network_interface    = "eni-05372dc6cd787311a"
      + private_dns          = "ip-10-0-101-45.ec2.internal"
      + private_ip           = "10.0.101.45"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "my-vpc-us-east-1a"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-00d09f2818d07549e"
        id                   = "eipalloc-0ac3f21f53d7e4e96"
      + network_interface    = "eni-0ef044efd8f66857e"
      + private_dns          = "ip-10-0-102-198.ec2.internal"
      + private_ip           = "10.0.102.198"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "my-vpc-us-east-1b"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0d4ba015212cb8925"
        id                   = "eipalloc-06193d4da1352b9a4"
      + network_interface    = "eni-039f27bdfdf66b332"
      + private_dns          = "ip-10-0-103-73.ec2.internal"
      + private_ip           = "10.0.103.73"
        tags                 = {
            "Environment" = "dev"
            "Name"        = "my-vpc-us-east-1c"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-010bfb6b8aa5e93a2"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0d5a3b174eaea604a"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "my-vpc-private-us-east-1a"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a0a03df345dc2474"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0131a6d0a20386ebd"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "my-vpc-private-us-east-1b"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0bedea0505f454bd8"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-02c1e4e481193e4cc"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "my-vpc-private-us-east-1c"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-00d1b188033716b49"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0d790f804e42daf0c"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "my-vpc-public"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-07dc2dd8e0efbc46a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0aa096d950e49d732"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "credible-pheasant-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-050a5d134bfc3f564"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-dYFFZG63MRnyBECq/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-dYFFZG63MRnyBECq/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @erickkendall, Action: `pull_request`*